<template>
    <div class="page-wrapper">
        <h2>Доставка</h2>
        <h3>Самовывоз</h3>
        <p>Получение товара в офисе компании в течение 2 дней после подтверждения заказа.</p>
        <h3>Курьерская доставка по Алматы</h3>
        <p>Доставка по указанному адресу, заранее оговаривается время и день доставки в рамках рабочего дня (с 08:00 до
            17:00). Стандартный срок доставки 2-3 рабочих дня.</p>
        <ul>
            <li>Физическим лицам: Доставка в городе Алматы 1000 тг при заказе до 100 000 тг, свыше 100 000 тг - БЕСПЛАТНО.
            </li>
            <li>Юридическим лицам: Доставка в городе Алматы 1000 тг при заказе до 200 000 тг, свыше 200 000 тг - БЕСПЛАТНО.
            </li>
        </ul>
        <h3>Курьерская доставка по Казахстану</h3>
        <p>Доставка через транспортную компанию «DPD Казахстан» по принципу «от двери до двери» во все регионы Казахстана.
            Узнать тарифы.</p>
        <h2>Оплата</h2>
        <h3>Наличный расчет</h3>
        <p>В национальной валюте Тенге. Выдаем фискальный чек и необходимые бухгалтерские документы.</p>
        <h3>Оплата через сервис KASPI</h3>
        <p>Возможна с помощью мобильного приложения Kaspi. Мы высылаем счет или QR-код с расчетного счета Kaspi на нашу
            компанию для оплаты удобным способом.</p>
        <h3>Безналичный расчет</h3>
        <p>Осуществляется на основании выставленного счета после предоставления клиентом реквизитов.</p>
    </div>
</template>

<script>
export default {
    name: 'DeliveryPage'
}
</script>

<style lang="scss">
.page {
    &-wrapper {
        background-color: $white;
        border-radius: $radius;
        padding: 30px;

        * {
            font-size: 16px;
        }

        h2 {
            color: $green;
            font-size: 28px;
            margin-bottom: 24px;
        }

        h3 {
            font-size: 20px;
        }

        img {
            display: block;
            margin: 16px auto;
            width: 100%;
            height: auto;
            object-fit: contain;
        }
    }
}

@media (max-width: 991px) {
    .page {
        &-wrapper {
            padding: 16px;

            * {
                font-size: 14px;
            }

            h2 {
                color: $green;
                font-size: 20px;
                margin-bottom: 24px;
            }

            h3 {
                font-size: 16px;
            }
        }
    }
}
</style>